DK/Development/Release 1.4.0/BizTalk/INTSTDK001.PubTransRealTime/Files/Pubtrans/GetDirectJourneysBetweenStopsRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:stop="http://schemas.pubtrans.hogia.se/webservices/dataset/2008/11/StopMonitoringService">
   <soapenv:Header/>
   <soapenv:Body>
      <stop:GetDirectJourneysBetweenStops>
         <!--Optional:-->
         <stop:fromStopAreaGid>9021012080000000</stop:fromStopAreaGid>
         <!--Optional:-->
         <stop:toStopAreaGid>9021012080051000</stop:toStopAreaGid>
         <!--Optional:-->
         <stop:forTimeWindowStartDateTime>2014-05-13T08:00:00</stop:forTimeWindowStartDateTime>
         <!--Optional:-->
         <stop:forTimeWindowDuration>59</stop:forTimeWindowDuration>
         <!--Optional:-->
         <stop:withDepartureMaxCount>99999</stop:withDepartureMaxCount>
         <!--Optional:-->
         <stop:forLineGids>9011012000800000</stop:forLineGids>
         <!--Optional:-->
         <!--Optional:-->
         <stop:purposeOfLineGroupingCode></stop:purposeOfLineGroupingCode>
      </stop:GetDirectJourneysBetweenStops>
   </soapenv:Body>
</soapenv:Envelope>